export default [
	{        
        title: 'Насле́дование (право)',
        desc: 'Переход имущества, прав и связанных с ними обязанностей умершего лица (наследодателя) к иным лицам (наследникам).Комплекс имущества, прав и обязанностей, получаемых при наследовании, называют наследственным имуществом, наследственной массой, наследством. ',
        developer: 0
    },
	{        
        title: 'Наследование (программирование)',
        desc: 'Концепция объектно-ориентированного программирования, согласно которой абстрактный тип данных может наследовать данные и функциональность некоторого существующего типа, способствуя повторному использованию компонентов программного обеспечения.',
        developer: 1
    },
	{        
        title: 'Полиморфизм (информатика)',
        desc: 'В языках программирования и теории типов полиморфизмом называется способность функции обрабатывать данные разных типов',
        developer: 2
    },
	{        
        title: 'Полиморфизм (биология)',
        desc: 'Полиморфи́зм в биологии (от др.-греч. πολύμορφος — многообразный) — способность некоторых организмов существовать в состояниях с различной внутренней структурой или в разных внешних формах.Внешний (а также внутренний, например, биохимический) полиморфизм может быть обусловлен внутривидовыми генетическими различиями. С другой стороны, возможен полиморфизм, при котором организмы с практически идентичным геномом в зависимости от внешних условий приобретают различные фенотипические формы. ',
        developer: 3
    },
	{        
        title: 'Инкапсуляция',
        desc: 'Инкапсуляция зачастую рассматривается как понятие, присущее исключительно объектно-ориентированному программированию (ООП), но в действительности обширно встречается и в других (см. подтипизация на записях и полиморфизм записей и вариантов).',
        developer: 4
    },
	{        
        title: 'Программирование',
        desc: 'В более широком смысле, программирование — процесс создания программ, то есть разработка программного обеспечения. Большая часть работы программиста связана с написанием исходного кода на одном из языков программирования.',
        developer: 5
    }
]
